{
  "architectures": [
    "BlipForConditionalGeneration"
  ],
  "image_text_hidden_size": 256,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "label_smoothing": 0.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "blip",
  "projection_dim": 512,
  "text_config": {
    "_attn_implementation_autoset": true,
    "attention_probs_dropout_prob": 0.0,
    "encoder_hidden_size": 768,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label_smoothing": 0.0,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "blip_text_model",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "projection_dim": 768,
    "torch_dtype": "float32",
    "use_cache": true,
    "vocab_size": 30524
  },
  "torch_dtype": "float32",
  "transformers_version": "4.51.1",
  "vision_config": {
    "_attn_implementation_autoset": true,
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "hidden_act": "gelu",
    "hidden_size": 768,
    "image_size": 384,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-05,
    "model_type": "blip_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "projection_dim": 512,
    "torch_dtype": "float32"
  }
}
